<details><summary>This plan is out of date. A new plan has been performed.</summary>

> 
> **Terraform plan** (Okta preview) ran in [2 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/20086777687).
> ```
> terraform plan -no-color -input=false -var-file=terraform.tfvars.json -target=okta_user.test2
> ```
> 
> #### Diff of changes
> ```diff
> + okta_user.test2 will be created
> 
> ```
> 
> <details>
> <summary>Plan: 1 to add, 0 to change, 0 to destroy.
> </summary>
> 
> ```
> [INFO] Starting Terraform preprocessing in terraform environment...
> [INFO] Cleaning up existing temporary files...
> [INFO] Consolidating .tf files from subdirectories into _consolidated.tf...
> [INFO] Consolidated 0 files into _consolidated.tf
> [INFO] Running terraform with arguments: plan -no-color -input=false -var-file=terraform.tfvars.json -target=okta_user.test2
> [INFO] Using terraform executable: /usr/local/bin/terraform
> 
> Terraform used the selected providers to generate the following execution
> plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # okta_user.test2 will be created
>   + resource "okta_user" "test2" {
>       + custom_profile_attributes = (known after apply)
>       + email                     = "example@example.com"
>       + expire_password_on_create = false
>       + first_name                = "John"
>       + id                        = (known after apply)
>       + last_name                 = "Smith"
>       + login                     = "example@example.com"
>       + raw_status                = (known after apply)
>       + skip_roles                = false
>       + status                    = "ACTIVE"
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> 
> 
> ```
> </details>
> 
</details>